{
  "basics": {
    "name": "Natan Žabkar",
    "label": "Software engineer",
    "picture": "",
    "email": "natan.zabkar@gmail.com",
    "phone": "+386 41 980 810",
    "website": "http://www.termitnjak.com/",
    "summary": "Interested in most technology-related fields, I strive to create clean, tested and well documented work that accurately expresses the ideas behind it. I value the Open Source community, both professionally, by trying to use Open Source solutions and opening our work where possible, and personally, by giving back to Open Source projects, submitting bug reports and attending sprints and meetings.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "Skype",
        "username": "nightmarebadger",
        "url": ""
      },
      {
        "network": "GitHub",
        "username": "nightmarebadger",
        "url": "https://github.com/nightmarebadger"
      },
      {
        "network": "LinkedIn",
        "username": "Natan Žabkar",
        "url": "http://si.linkedin.com/in/natanzabkar"
      }
    ]
  },
  "work": [
    {
      "company": "Termitnjak d.o.o.",
      "position": "Software Engineer",
      "website": "http://www.termitnjak.com/",
      "startDate": "2013",
      "endDate": "",
      "summary": "In 2013 I have joined Termitnjak d.o.o. as a software developer. After a learning period under the lead developer I have started to work on development oriented tasks concentrating mostly on the back-end (Python) and front-end (HTML, CSS, SASS, JS) but also working on project deployment, SVN to GIT migration and other similar tasks. Together with my colleagues we have created intranet solutions, web applications and portals for customers from Slovenia, Australia, UK, German, USA and Italy.",
      "highlights": [
        "Design and development of back-end solutions",
        "Development of front-end solutions that conform to the WCAG 2.0 standard",
        "Cross browser testing (using SauceLabs)"
      ]
    },
    {
      "company": "Gimnazija Vič, Ljubljana",
      "position": "Head of the programming club",
      "website": "http://gimvic.org/",
      "startDate": "2012",
      "endDate": "",
      "summary": "In 2012, I have taken over the programming club. The main focus is to teach programming in a fun, easy and presentable way. We allow our students to choose their own projects and focus on useful skills and not only on competitions (as most programming clubs tend to do in our country). ",
      "highlights": []
    },
    {
      "company": "University of Ljubljana, FMF",
      "position": "Demonstrator / Teaching assistant",
      "website": "http://www.fmf.uni-lj.si/en/",
      "startDate": "2010",
      "endDate": "2013",
      "summary": "From 2010 to 2013 I have worked as a teaching assistant at my university. I have taught two Computer Lab courses, one for Mathematicians and one for Physicists. The Mathematician course was focused on general computer knowledge (Word, Excel, Mathematica, LaTeX with Beamer, basic HTML and CSS), while the Physicists course was focused on programming in C (basic C syntax, basic algorithms).",
      "highlights": [
        "Teaching the course through material provided by the professor",
        "Creating tasks from which the professor made tests",
        "Evaluating/grading exams",
        "Evaluating/grading assignments"
      ]
    },
    {
      "company": "University of Ljubljana, FMF",
      "position": "Helping at the computer center",
      "website": "http://www.fmf.uni-lj.si/en/",
      "startDate": "2011",
      "endDate": "2012",
      "summary": "Helping set up a customised Linux distribution with global faculty user accounts that spanned over both Windows and Linux machines. Also helped with setting up new machines and maintaining computers used by the staff. ",
      "highlights": []
    },
    {
      "company": "Gimnazija Vič, Ljubljana",
      "position": "Co-head of the programming club",
      "website": "http://gimvic.org/",
      "startDate": "2009",
      "endDate": "2012",
      "summary": "In 2009, I have started teaching at the programming club at Gimnazija Vič.",
      "highlights": [
        "Creating an education model for complete beginners",
        "Teaching Python, basic Mathematics, basic Physics and basic Computer Science to complete beginners and beginners",
        "Writing monthly and yearly reports"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Open Source",
      "position": "",
      "website": "",
      "startDate": "2013",
      "endDate": "",
      "summary": "I believe that the Open Source movement and community is very important. As such I try to make sure I use Open Source solutions and contribute back to the community where possible. In the last few years, I have tried to help in various projects, mainly by issuing bug reports and writing code.",
      "highlights": [
        "Attended various talks and conferences (EuroPython 2014, WebCamp Ljubljana 2015, ... )",
        "Hosted a talk at one of the Python Meetups in Ljubljana",
        "Helped organise two Zidanca sprints, one focused on Kotti and NixOS, the second being a strategic Plone sprint focused on Plone 5",
        "Various work on different Open Source projects, mainly Plone, Pyramid and Kotti"
      ]
    },
    {
      "organization": "KUD Impromobile",
      "position": "System administrator",
      "website": "http://eng.impromobile.si/",
      "startDate": "2013",
      "endDate": "2014",
      "summary": "In 2013 we created Cultural Arts Society Impromobile (an improvisational theatre group) with a group of friends and I took care of all the IT things we needed. This included setting up a base simple to use site, registering domains, setting up DNS servers, emails, Google Apps, Google Analytics etc.",
      "highlights": []
    },
    {
      "organization": "Gimnazija Vič, Ljubljana",
      "position": "System administrator",
      "website": "http://gimvic.org/ ",
      "startDate": "2007",
      "endDate": "2009",
      "summary": "From 2007 to 2009 I administrated the server and took care of the web page at my high school. It was based on a custom PHP solution, but we started moving it towards a Python web framework (Bottle) in 2009.",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "University of Ljubljana, FMF",
      "area": "Mathematics",
      "studyType": "Bachelor",
      "startDate": "2009",
      "endDate": "",
      "gpa": "",
      "courses": [
        "Computer Lab",
        "Programming 1",
        "Programming 2",
        "Coding Theory and Cryptography",
        "Mathematical modelling",
        "Data structures and algorithms 1",
        "Data structures and algorithms 2",
        "Optimisation 1",
        "Game Theory"
      ]
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Job-related skills",
      "level": "",
      "keywords": [
        "Very good knowledge of the Python programming language",
        "Very good knowledge of front-end technologies (HTML, CSS, LESS, SASS) and browser compatibility, knowledge of JS",
        "Very good knowledge of GIT and knowledge of SVN",
        "Very good knowledge of several web development frameworks (Plone, Pyramid, Kotti)",
        "Good knowledge of ZODB and SQL databases",
        "Good knowledge of Python testing (unit tests, integration tests, functional testing with the Robot framework)",
        "Good knowledge and usage of various validators (pyflakes, jshint, ... )",
        "Knowledge of application design, analysis and modelling",
        "Knowledge of various Python modules related to visualisation, mathematics, data gathering, writing games, such as Tkinter, PyGame, Pyglet, Cocos2d, NumPy, Matplotlib, ...",
        "Some knowledge of OpenGL 3 and 4",
        "Some knowledge of Kivy and the Kivy programming language - a cross-platform (Windows, Linux, MacOS, iOS, Android) Python framework for natural user interface development that makes use of innovative user interfaces such as multi-touch apps"
      ]
    },
    {
      "name": "Communication skills",
      "level": "",
      "keywords": [
        "Good teaching and presentation skills gained during my instructions, teaching the programming club and teaching at the university",
        "Good teamwork and communication skills gained during the 8 years as an improvisational theatre actor"
      ]
    },
    {
      "name": "Organisational / managerial skills",
      "level": "",
      "keywords": [
        "Organisational skills gained through leading the programming club, leading an improvisational theatre team and founding CAS Impromobile."
      ]
    },
    {
      "name": "Computer skills",
      "level": "",
      "keywords": [
        "Good knowledge of Windows (XP and forward) and Linux (various distributions, Debian, *buntu family, Arch, Gentoo, ... )",
        "Good knowledge of Microsoft Word, Excel and it's LibreOffice variants (Writer and Calc)",
        "Knowledge of Markdown, RST, LaTeX",
        "Knowledge of creating presentations in either HTML (reveal.js), LaTeX (via Beamer), Microsoft PowerPoint and LibreOffice Impress",
        "Knowledge and experience with pandoc, which can be used to translate between various formats, e.g. Markdown, HTML, reveal.js, LaTeX, ..."
      ]
    }
  ],
  "languages": [
    {
      "language": "Slovenian",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Full proficiency (C1 certificate)"
    },
    {
      "language": "German",
      "fluency": "Basic proficiency"
    }
  ],
  "interests": [],
  "references": []
}
